In [1]:
import pandas as pd

#### pandas.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)[source]
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on columns, the DataFrame indexes will be ignored. Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on. When performing a cross merge, no column specifications to merge on are allowed.

In [2]:
df1=pd.DataFrame({'id':[12,23,45],'class':[9,10,12]})
df1

   id  class
0  12      9
1  23     10
2  45     12

In [3]:
df2=pd.DataFrame({'id':[12,23,45],'name':['mohak','nitish','ronik']})
df2

   id    name
0  12   mohak
1  23  nitish
2  45   ronik

### merging these 2 data frames

In [4]:
df3=pd.merge(df1,df2)
df3

   id  class    name
0  12      9   mohak
1  23     10  nitish
2  45     12   ronik

In [5]:
df3=pd.merge(df1,df2,on='id') #id must be common in both df
df3

   id  class    name
0  12      9   mohak
1  23     10  nitish
2  45     12   ronik

### changing the order of df2/df2 using left/right

In [6]:
df3=pd.merge(df2,df1,on='id') #id must be common in both df
df3

   id    name  class
0  12   mohak      9
1  23  nitish     10
2  45   ronik     12

#### if values are not same then that row will be avoided

In [7]:
df1=pd.DataFrame({'id':[1,2,3,4,5],'class':[9,10,12,14,75]}) #it has more value than df2
df2=pd.DataFrame({'id':[1,2,3],'name':['a','b','c']})#if values less then it will print NaN
df3=pd.merge(df1,df2,on='id',how='left')  #left means it will be intersection by left side
df3

   id  class name
0   1      9    a
1   2     10    b
2   3     12    c
3   4     14  NaN
4   5     75  NaN

In [8]:
df1=pd.DataFrame({'id':[1,2,3,4,5],'class':[9,10,12,14,75]}) 
df2=pd.DataFrame({'id':[1,2,3],'name':['a','b','c']})
df3=pd.merge(df1,df2,on='id',how='right')  
df3

   id  class name
0   1      9    a
1   2     10    b
2   3     12    c

In [9]:
df1=pd.DataFrame({'id':[1,2,3,4,5],'class':[9,10,12,14,75]}) 
df2=pd.DataFrame({'id':[1,2,3],'name':['a','b','c']})
df3=pd.merge(df1,df2,on='id',how='outer')  
df3

   id  class name
0   1      9    a
1   2     10    b
2   3     12    c
3   4     14  NaN
4   5     75  NaN

##### indiactor will tell information about each row

In [10]:
pd.merge(df1,df2,on='id',how='outer',indicator=True)

   id  class name     _merge
0   1      9    a       both
1   2     10    b       both
2   3     12    c       both
3   4     14  NaN  left_only
4   5     75  NaN  left_only

In [11]:
df1

   id  class
0   1      9
1   2     10
2   3     12
3   4     14
4   5     75

In [12]:
df2

   id name
0   1    a
1   2    b
2   3    c

In [13]:
df1=pd.DataFrame({'id':[1,2,3,4],'class':[6,2,7,9]})
df2=pd.DataFrame({'id':[5,6,7,8],'names':['a','b','c','d']})

In [14]:
df1

   id  class
0   1      6
1   2      2
2   3      7
3   4      9

In [15]:
df2

   id names
0   5     a
1   6     b
2   7     c
3   8     d

In [18]:
pd.merge(df1,df2,left_index=True,right_index=True) #this will give the id

   id_x  class  id_y names
0     1      6     5     a
1     2      2     6     b
2     3      7     7     c
3     4      9     8     d

In [17]:
pd.merge(df1,df2) #becuse have don't have any no same column with same data

Empty DataFrame
Columns: [id, class, names]
Index: []

In [23]:
df1=pd.DataFrame({'id':[1,2,3,4],'class':[6,2,7,9]})
df2=pd.DataFrame({'id':[1,2,3,4],'class':[6,2,7,9]})

In [24]:
df1

   id  class
0   1      6
1   2      2
2   3      7
3   4      9

In [25]:
df2

   id  class
0   1      6
1   2      2
2   3      7
3   4      9

### both df are same , now merge them

In [26]:
pd.merge(df1,df2,on='id')

   id  class_x  class_y
0   1        6        6
1   2        2        2
2   3        7        7
3   4        9        9

In [29]:
pd.merge(df1,df2,on='id',suffixes=('_Higher','_Middle'))

   id  class_Higher  class_Middle
0   1             6             6
1   2             2             2
2   3             7             7
3   4             9             9